https://towardsdatascience.com/pandas-python-tricks-for-data-science-data-analysis-part-2-dc36460de90d

In [1]:
cities = ["Abidjan","Bamako","Dakar","Abidjan","Dakar"]

unique_cities=[]
for city in cities:
    if city not in unique_cities:
        unique_cities.append(city)
print(unique_cities)
unique_cities = list(set(cities))
print(unique_cities)

['Abidjan', 'Bamako', 'Dakar']
['Abidjan', 'Bamako', 'Dakar']

In [3]:
# Preserve original order
countries = ["Ivory Coast","Mali","Senegal","Ivory Coast","Benin","Mali","Senegal"]
print(list(set(countries))) # does not preserve order
list(dict.fromkeys(countries))

['Senegal', 'Ivory Coast', 'Mali', 'Benin']

['Ivory Coast', 'Mali', 'Senegal', 'Benin']

In [4]:
cities = ["Abidjan","Bamako","Dakar","Abidjan","Dakar"]
search_criteria = "Bamako"
result=False
for city in cities:
    if (city==search_criteria):
        result=True
print(result)

True

In [5]:
result=search_criteria in cities
print(result)

True

In [7]:
from heapq import nlargest, nsmallest
my_list=[45,10,436,89,100,43546,855]
print(nlargest(3,my_list))
print(nsmallest(3,my_list))

[43546, 855, 436]
[10, 45, 89]

In [8]:
import pandas as pd
candidates_df = pd.DataFrame({
    "Name":["Aida","Mamadou","Ismael","Aicha","Fatou","Khalil"],
    "Degree":["Master","Master","Bachelor","PhD","Master","Phd"]
})

In [9]:
candidates_df.head(3)
candidates_df.tail(3)

     Name  Degree
3   Aicha     PhD
4   Fatou  Master
5  Khalil     Phd

In [10]:
display(candidates_df.head(3))
display(candidates_df.tail(3))

      Name    Degree
0     Aida    Master
1  Mamadou    Master
2   Ismael  Bachelor

     Name  Degree
3   Aicha     PhD
4   Fatou  Master
5  Khalil     Phd

In [13]:
import pandas as pd
URL="https://en.wikipedia.org/wiki/World_energy_supply_and_consumption"
world_energy_consumptions=pd.read_html(URL)
print(f'Number of Tables: {len(world_energy_consumptions)}')
world_energy_consumptions[6]

Number of Tables: 8

,Country,FuelMtoe,of whichrenewable,ElectricityMtoe,of whichrenewable.1
0,Germany,156,10%,45,46%
1,France,100,12%,38,21%
2,United Kingdom,95,5%,26,40%
3,Italy,87,9%,25,39%
4,Spain,60,10%,21,43%
5,Poland,58,12%,12,16%
6,Ukraine,38,5%,10,12%
7,Netherlands,36,4%,9,16%
8,Belgium,26,8%,7,23%
9,Sweden,20,35%,11,72%
10,Austria,20,19%,5,86%
11,Romania,19,20%,4,57%
12,Finland,18,34%,7,39%
13,Portugal,11,20%,4,67%
14,Denmark,11,15%,3,71%
15,Norway,8,16%,10,100%